Repository: danirabbit/nimbus
Catalog: po/extra/*.po
Languages: fr, ru

source: See outside without going there
fr: Voir à l'extérieur sans y aller
ru: Смотрите, что происходит снаружи, не выходя туда

source: See the current temperature and weather conditions for your location with this minimal color-changing applet.
fr: Visualisez la température et les conditions météorologiques actuelles de votre emplacement grâce à cette petite application aux couleurs changeantes.
ru: Получайте текущую температуру и погоду для вашего местоположения с помощью этого минималистичного апплета, меняющего цвет.

source: Click anywhere to fetch the latest weather
fr: Cliquez n'importe où pour actualiser la météo
ru: Нажмите в любом месте, чтобы получить последнюю информацию о погоде

source: Stays out of your way by always sticking to the desktop
fr: Reste à l'écart de votre chemin en restant toujours sur le bureau
ru: Не мешается у вас на пути, всегда придерживаясь рабочего стола

source: Move the window by dragging any part of it
fr: Déplacez la fenêtre en faisant glisser n'importe quelle partie de celle-ci
ru: Перемещайте окно за любую его часть

source: Quit with the handy shortcut Ctrl + Q
fr: Quittez avec le raccourci pratique Ctrl + Q
ru: Закрывайте с помощью удобного сочетания Ctrl + Q

source: Respects your system settings for temperature units
fr: Respecte vos paramètres du système pour les unités de température
ru: Следует вашим системным настройкам единиц температуры

source: Updated for OS 7!
ru: Обновление для OS 7!

source: New animated rain effect 🌧️
ru: Новый анимированный эффект дождя 🌧️

source: Redesigned app icon
ru: Редизайн иконки приложения

source: Added Portuguese translation, thanks to @rottenpants466
ru: Добавлен португальский перевод, спасибо @rottenpants466

source: Updated to the latest platform libraries, thanks to Ryo Nakano
ru: Библиотеки платформы были обновлены до последних версий, спасибо Ryo Nakano

source: Better error handling and messaging
ru: Улучшена обработка ошибок и формулировки сообщений

source: Odin Updates!
ru: Обновления для Odin!

source: Add Danish and Dutch and update French and Japanese Translations
ru: Добавлены датский и голландский переводы, и обновлены французский и японский переводы

source: Bug fixes and stability improvements
fr: Corrections de bugs et améliorations de la stabilité
ru: Исправления ошибок и улучшения стабильности

source: Juno Updates!
fr: Mises à jour pour Juno !
ru: Обновления для Juno!

source: Add Catalan, French, German, and Japanese Translations
fr: Ajout des traductions en catalan, français, allemand et japonais
ru: Добавлены каталонский, французский, немецкий и японский переводы

source: HiDPI icons support
fr: Prise en charge des icônes HiDPI
ru: Поддержка HiDPI иконок

source: weather;temperature;
fr: météo;température;
ru: weather;temperature;погода;температура;
